Repository: v-reutov/python_webapp
Catalog: ontogen/locale/*/LC_MESSAGES/django.po
Languages: ru

source: instruction label
ru: Название инструкции

source: instruction text
ru: Текст инструкции

source: pattern label
ru: Название шаблона

source: pattern text
ru: Текст шаблона

source: Concept
ru: Концепт

source: Relation
ru: Отношение

source: extracted elements type
ru: Тип извлекаемых элементов

source: mapping label
ru: Название соотвествия

source: mapping value
ru: Значение соотвествия

source: subject ontology
ru: предметная онтология

source: applied ontology
ru: прикладная онтология

source: ontology type
ru: тип онтологии

source: Instructions
ru: инструкции

source: Patterns
ru: шаблоны

source: Resources
ru: ресурсы

source: Welcome
ru: Добро пожаловать

source: guest
ru: гость

source: Ontology generation
ru: Создание онтологии

source: Usage history
ru: История использования

source: Experiments history
ru: История экспериментов

source: Performed by
ru: Исполнитель

source: Used instruction
ru: Использованная инструкция

source: Collapse block
ru: Свернуть блок

source: Used patterns
ru: Использованные шаблоны

source: Mappings
ru: Соответствия

source: Result
ru: Результат

source: Collapse record
ru: Свернуть запись

source: Repository tree
ru: Дерево хранилища

source: Generate Ontologies
ru: Построить онтологии

source: Are you sure you want to delete instruction
ru: Вы уверены, что хотите удалить инструкцию

source: Confirm
ru: Подтвердить

source: Save
ru: Сохранить

source: Please correct the error below.
ru: Исправьте ошибки

source: Please correct the errors below.
ru: Исправьте ошибки

source: You are authenticated as %(user)s. Would you like to login to a different account?
ru: Вы вошли как %(user)s. Войти под другой учетной записью?

source: Log in
ru: Войти

source: Mapping label
ru: Название соответствия

source: Mapping value
ru: Значение соответствия

source: add
ru: добавить

source: You don't have enough permissions to
ru: У Вас недостаточно прав для того, чтобы

source: Back to repository tree
ru: Вернуться к дереву хранилища

source: Resulting ontologies
ru: Полученные онтологии

source: Download subject ontology
ru: Скачать предметную онтологию

source: Download applied ontology
ru: Скачать прикладную онтологию

source: Add new instruction
ru: Добавление инструкции

source: Edit instruction
ru: Изменение инструкции

source: No instruction was selected
ru: Инструкция не выбрана

source: No patterns were selected
ru: Шаблоны не выбраны

source: Edit pattern
ru: Изменение шаблона

source: Add new pattern
ru: Доабвление шаблона

source: create new patterns
ru: создавать шаблоны

source: edit patterns
ru: изменять шаблоны

source: delete patterns
ru: удалять шаблоны

source: add instructions
ru: добавлять инструкции

source: edit instructions
ru: добавлять шаблоны

source: delete instructions
ru: удалять шаблоны
