Repository: v-reutov/python_webapp
Catalog: sqrt_platform/locale/*/LC_MESSAGES/django.po
Languages: es, ru, zh_hant

source: "{}" is not a real or complex number
es: "{}" no es un número real o complejo
ru: "{}" не является действительным или комплексным числом
zh_hant: "{}" 不是一個真實或複雜的數字

source: Next expression evaluate will be available in {} sec.
es: La siguiente de la evaluación expresión estará disponible en {} seg.
ru: Следующее вычисление выражения будет доступно через {} сек.
zh_hant: 下一個表達式計算將在 {} 秒內可用。

source: Invalid expression. Try again in {} sec.
es: Expresión no válida. Inténtalo de nuevo en {} seg
ru: Некорректное выражение. Попробуйте еще раз через {} сек.
zh_hant: 表達式無效 在 {} 秒內再試一次

source: Square root calculator
es: Calculadora de raíz cuadrada
ru: Нахождение квадратного корня
zh_hant: 平方根計算器

source: Choose language
ru: Выберите язык
zh_hant: 選擇語言

source: <p> Enter the number or mathematical expression whose square root you want to find in the “Number/Expression” field. It can be an integer or a fractional number, a large number, a complex number. <br/>Terms of use: <ul> <li>Use the symbol "." аs the separator of the whole and fractional part of the number.</li> <li>Use "i" as the imaginary unit in the complex number.</li> <li>It is possible to use in the expression the signs of arithmetic operations, the symbol "^" or "**" for exponentiation, parentheses, sqrt (expression) - square root, abs (expression) - module, as well as various trigonometric functions.</li> </ul> </p> <p> If you want to set the precision, open the menu “Show precision” and enter amount of decimal places in the answer. </p> <p> Click the "Calculate" button to get the square root of the number and "Calculate expression" to get the square root of the expression. The resulting square root will be in the text field below the button. If no response was received, check the original data. If it is true, try again. If this problem persists, contact the support via <a href="http://sqrtme.mybb.ru/">forum</a> or by e-mail <a href="mailto:groot.sqrt@mail.ru" target="_top">groot.sqrt@mail.ru</a>. </p>
ru: <p> В поле «Число/Выражение» введите число или математическое выражение, квадратный корень которого нужно найти. Число может быть вещественным, в том числе и длинным, а также комплексным. <br/>Правила использования: <ul> <li>В качестве разделителя целой и дробной части числа используйте символ «.».</li> <li>b. Мнимая единица в комплексном числе обозначается «i».</li> <li>c. В выражении возможно использовать знаки арифметических операций, символ «^» или «**» для возведения в степень, скобки, функцию sqrt(выражение) – квадратный корень, abs(выражение) – модуль, а также различного рода тригонометрические функции.</li> </ul> </p> <p> Если необходимо задать точность, откройте меню «Показать точность» и введите число знаков после запятой в ответе. </p> <p> Для получения ответа нажмите кнопку «Вычислить» для получения корня числа и «Вычислить выражение» для получения корня выражения. Полученный квадратный корень будет находиться в текстовом поле ниже кнопки. Если ответ не был получен, проверьте исходные данные. Если верно, то попробуйте ещё раз. В случае повторения данной проблемы обратитесь в службу поддержки: на <a href="http://sqrtme.mybb.ru/">форум</a> или по электронной почте <a href="mailto:groot.sqrt@mail.ru" target="_top">groot.sqrt@mail.ru</a>. </p>
zh_hant: <p> 2) 在“數字/表達式”字段中輸入要查找其平方根的數字或數學表達式。 它可以是整數或小數，大數，複數. <br/>使用條款: <ul> <li>使用符號“.” 是數字的整體和分數部分的分隔符.</li> <li>使用“i”作為複數中的虛數單位.</li> <li>c. 在表達式中可以使用算術運算的符號，用於取冪的符號 “^” 或 “**”，括號，sqrt（表達式） - 平方根，abs（表達式） - 模塊以及各種三角函數.</li> </ul> </p> <p> 如果要設置精度，請打開菜單“顯示精度”，並在答案中輸入小數位數. </p> <p> 4) 單擊“計算”按鈕獲取數字的平方根，並使用“計算表達式”獲取表達式的平方根. 結果平方根將位於按鈕下方的文本框中. 如果沒有收到回复，請檢查原始數據. 如果是，請再試一次. 如果此問題仍然存在，請聯繫支持 <a href="http://sqrtme.mybb.ru/">論壇</a> 或通過電子郵件 <a href="mailto:groot.sqrt@mail.ru" target="_top">groot.sqrt@mail.ru</a>. </p>

source: Number / Expression
es: Número / Expresión
ru: Число / Выражение
zh_hant: 數 / 表达式

source: Precision
es: Precisión
ru: Точность
zh_hant: 精確

source: Having troubles with our app? Visit our forum!
ru: Возникли проблемы с приложением? Посетите наш форум!
zh_hant: 遇到麻煩與我們的應用程序？ 訪問我們的論壇

source: Calculate
es: Calcular
ru: Вычислить
zh_hant: 計算

source: Calculate expression
es: Calcular la expresión
ru: Вычислить выражение
zh_hant: 计算表达式

source: Show precision
es: Mostrar precisión
ru: Показать точность
zh_hant: 显示精度

source: Hide precision
es: Ocultar precisión
ru: Скрыть точность
zh_hant: 隐藏精度

source: Number is required
es: Número necesaria
ru: Необходимо указать число
zh_hant: 需要号码

source: Expression is required
es: Expresión necesaria
ru: Необходимо указать выражение
zh_hant: 表達是必需的
